[
    {
        "name":"WHEAT",
        "subname":"wheat crop cultivationn",
        "cro":"Wheat (Triticum spp.) occupies the prime position among the food crops in the world. In India, it is the second important food crop being next to rice and contributes to the total foodgrain production of the country to the extent of about 25%. Wheat has played a very vital role in stabilizing the foodgrain production in the country over the past few years",
        "climate":"The ideal temperature requirement varies from plant type and stages of growth. The dwarf varieties require the following temperature for their growth and development",
        "c1":"Germination",
        "r1":"20 to 25 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"16 to 20 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"20 to 23 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 25 0 C mean daily temperature.",
        "land":"The wheat crop requires a well-pulverized but compact seed bed for good and uniform germination. Three or four ploughings in the summer, repeated harrowing in the rainy season, followed by three or four cultivations and planking immediately before sowing produce a good, firm seed bed for the dry crop on alluvial soils. For the irrigated crop, the land is given a pre-sowing irrigation (palewa or raund) and the number of ploughings is reduced. Where white ants or other pests are a problem, Aldrin 5% or BHC 10% dust at the rate of 25 kg/ha should be applied to the soil after the last ploughing or before planking",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"HD 2189, Malvika, HD-2380, MACS 2496, Purna,HD-2278, NI-5439, PBN-142",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"Sonalika, AKW-381, HI-977, Purna, HD 2610, NI-9947, NIAW 34",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"Smut",
        "pd2":"Roguing & burning of disease affected plants",
        "pd3":"Seed dressing with Vitavax/Benlate/G 696",
        "pd4":"2-2.5 g/kg of seed",
        "pd1":"Rust",
        "pd12":"Use of resistant varieties",
        "pd13":"Zinc/Manganese",
        "pd14":"3-3.5 g/kg of seed",
        "pd02":"Molya",
        "pd22":" Deep summer ploughing",
        "pd23":"Nemagon DECP 60% EC dripping with first irrigation water",
        "pd24":"20 litres/ha 30 ml./ha",
        "har":"Harvesting:",
        "har1":"The rain-fed crop reaches the harvest stage much earlier than the irrigated crop. The crop is harvested when the grains become hard and the straw becomes dry and brittle.The harvesting is mostly done by sickle. The crop is threshed by treading with cattle on the threshing-flour or by power driven thresher.",
        "yie":"Yield:",
        "yie1":"The national average yield of wheat grain is about 12 to 13.8 quintals per hectare.",
        "sto":" Storage:",
        "sto1":"The grains should be thoroughly dried before storage. The storage life of the grain is closely related to its moisture content. Grains with less than 10 percent moisture store well. The storage pits, bins or godowns should be moisture-proof and should be fumigated to keep down the stored – grain pests including rats. Zinc phosphide is very effective against rats."
        
    },
    {
        "name":"RAGI",
        "subname":"ragi crop cultivationn",
        "cro":"Ragi is cultivated on a variety of soils ranging from rich loam to poor shallow upland soils.It prefers porous and well drained loam to light red loam and sandy loam soils of good fertility but reasonable water holding capacity.It can tolerate some water logging. Black soils with sufficient drainage capacity also support to cultivate Ragi crop.In southern India, it predominates on marginal soil conditions, provided by lateritic and red sandy loams",
        "climate":"Ragi may be grown as a hot weather crop, from May to September, using long duration varieties and as a cold season crop, from November and December, using early typesThe soil should be rich in organic matter. Deep vertisols and rocky soils are not suitable for this crop owing to poor drainage and low fertility .It can be grown in soils with pH of 4.5-7.5",
        "c1":"Germination",
        "r1":"30 to 35 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"20 to 25 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"22 to 27 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 25 0 C mean daily temperature.",
        "land":"The land is prepared separately for irrigated and rainfed conditions. In areas with a rainfall of 60 to 75 cm, ragi is cultivated as a rainfed crop. So the field should be deeply ploughed for moisture conservation. But in irrigated crop, plough the field immediately at the arrival of monsoon until gets fine tilth.",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"Paiyur 1, CO 12, Co 13, K5, K6, K7",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"Saradha, AKP 1, AKP 2, Co 1, Co 2, k3, k4, k5",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"BLAST",
        "pd2":"Infects at any stage of the growth from the seedling to the grain formation stage",
        "pd3":"Grow resistant varieties like CO RA (14), Paiyur (RA)-2, GPU-28, GPU-45,GPU-48, L-5",
        "pd4":"Seed treatment with carbendazim @ 1 gm/Kg of seed",
        "pd1":"FOOT ROT/WILT",
        "pd12":"Infects at any stage of the growth from the seedling to the grain formation stage",
        "pd13":"The pathogen forms a submerged vegetative mycelium consisting of single hyphae.",
        "pd14":"Spot drench with Copper oxychloride at 0.25 per cent for prevent spread of disease",
        "pd02":"MOSSAIC",
        "pd22":" The first symptom is chlorosis, followed by mosaic mottling and severe stunting of the plant.",
        "pd23":"The first symptom is chlorosis, followed by mosaic mottling and severe stunting of the plant.",
        "pd24":"Spray Methyl dematon 25 EC 500 ml/ha ",
        "har":"Harvesting:",
        "har1":"Ragi matures 3-5 months after sowing, depending on variety, season and soil properties. Rainfed crops are cut close to ground, stalks are allowed to wither for a day or two in field",
        "yie":"Yield:",
        "yie1":"The average yield of the rain-fed crop ranges from 10 to 15 q/ha, whereas the irrigated crop yields up to 40 or 50 q/ha. The fodder yield ranges from 30-90 q/ha in the case of the late groups.",
        "sto":" Storage:",
        "sto1":"The grains should be thoroughly dried before storageand then bundled and stacked for about 2 months before threshing. To separate the grains, dried earheads are beaten with sticks, sheaves are trodden by bullocks or crushed by stone rollers"
        
    },
    {
        "name":"RICE",
        "subname":"rice crop cultivationn",
        "cro":"ice accounts for 80% of the calories eaten in Asia, or one-fifth of the calories eaten worldwide by humans.It is the agricultural commodity with the third-highest worldwide production.Rice used to be the main diet in many countries. Various kinds of food processing prepare rice for eating.",
        "climate":"In India rice is grown under widely varying conditions of altitude and climate. Rice crop needs a hot and humid climate. It is best suited to regions which have high humidity, prolonged sunshine and an assured supply of water.The average temperature required throughout to the crop throughout its life ranges from 21 to 37º C. Maximum temp in which the crop can grow is 400C to 42 0C. ",
        "c1":"Germination",
        "r1":"20 to 30 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"20 to 25 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"15 to 35 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"20 to 30 0 C mean daily temperature.",
        "land":"The wheat crop requires a well-pulverized but compact seed bed for good and uniform germination. Three or four ploughings in the summer, repeated harrowing in the rainy season, followed by three or four cultivations and planking immediately before sowing produce a good, firm seed bed for the dry crop on alluvial soils. For the irrigated crop, the land is given a pre-sowing irrigation (palewa or raund) and the number of ploughings is reduced. Where white ants or other pests are a problem, Aldrin 5% or BHC 10% dust at the rate of 25 kg/ha should be applied to the soil after the last ploughing or before planking",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"Jasmine rice, Brown rice, Red cargo rice, Parboiled rice.",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"Arborio rice, Basmati rice, Black rice, Sticky rice",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"False smut",
        "pd2":"Roguing & burning of disease affected plants",
        "pd3":"Seed dressing with Vitavax/Benlate/G 696",
        "pd4":"1-1.5 g/kg of seed",
        "pd1":"Leaf Scald",
        "pd12":"zonate lesions of alternating light tan and dark brown starting from leaf tips or edge",
        "pd13":"Use benomyl, carbendazim, quitozene, and thiophanate-methyl to treat seeds",
        "pd14":"2-2.5 g/kg of seed",
        "pd02":"Sheath blight",
        "pd22":"High seeding rate or close plant spacing, dense canopy, disease in the soil",
        "pd23":"use fungicide to treat seeds",
        "pd24":"20 litres/ha 25 ml./ha",
        "har":"Harvesting:",
        "har1":"Harvesting can take place manually or mechanically. In manual harvesting, workers collect rice plants from the rice paddies using sharp knives. Then, they carefully clean them and separate the damaged ones..",
        "yie":"Yield:",
        "yie1":"The average yield of rice (seeds) per hectare is 3 – 6 tons. In some countries like Australia and in Egypt, the yield can increase to an amazing 10 – 12 tons or more per hectare. (1 ton = 1000 kg = 2200 lbs. and 1 hectare = 2,47 acres = 10.000 square meters).",
        "sto":" Storage:",
        "sto1":" After the harvest, grains normally contain about 25% moisture. If we let them without doing anything, this may lead to grain discoloration and potential attacks from pests. So, before storing grains, in most cases, farmers dry the grains out. There are two ways of drying."
        
    },
    {
        "name":"MAIZE",
        "subname":"Maize crop cultivationn",
        "cro":"Maize is one of the most important cereals of the world. With its world average yield of 27.8 q  maize ranks first among the cereals and is followed by rice, wheat, and millets, with average grain yield of 22.5, 16.3 and 6.6 q/ha respectively. In terms of world acreage, India stands only next to the USA, Brazil, China and Mexico, with regards to production to ranks eleventh countries in order of production are USA, China, Brazil, Argentina, Mexico, France, South Africa, the USSR, Rumania, Yugoslavia and India",
        "climate":"Maize requires fertile, deep and well drained soils. However, it can be grown on any type of soil, ranging from deep heavy clays to light sandy ones. It is, however, necessary that the pH of the soil does not deviate from the range 7.5 to 8.5 Maize plants, particularly in the seedling stage, are highly susceptible to salinity and water . Accordingly the provision of proper drainage is essential for the successful cultivation of this crop",
        "c1":"Germination",
        "r1":"20 to 25 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"16 to 20 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"20 to 23 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 25 0 C mean daily temperature.",
        "land":"A good seedbed for maize should be fine but compact, and free from weeds. It is desirable that the previous crop refuse is buried under with a mouldboard plough. In due course, two or three ploughings with the wooden plough are given. In case the tractor is used, one ploughing followed by a couple of diskings is generally adequate",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"Malan, Sathi, Kathi and teen Pakhi, Jawahar",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"Basi ,KT 41, Jaunpur, Rudrapur Local, Rattan, Protina",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"Stem bore",
        "pd2":"These borers feed on leaves in the earlier stages. Later on they bore into the stem and cobs, rendering the plant unproductive.",
        "pd3":"Thiodan 35 EC @ 27 ml in 18 litres water,",
        "pd4":" Atrazine @ 1-1.25 sprayin",
        "pd1":"Aphids",
        "pd12":"Use of resistant varieties",
        "pd13":"Zinc/Manganese",
        "pd14":"soil application of 10-20 kg/ha of zinc sulphate ",
        "pd02":"Termites",
        "pd22":" hese pests attack young seedlings as well as mature plants; attack is also visible on roots and lower parts of the plants.",
        "pd23":"Thiodan 4 % Dust @ 12-15 kg per hectare is applied and mixed well with the soil.",
        "pd24":" 10-20 kg of 10% DDT or BHC per hectare",
        "har":"Harvesting:",
        "har1":"The maize crop sown for grain is harvested when the grains are nearly dry and do not contain more than 20 per cent moisture. The appearance of the plant may be misleading, particularly in the case of high yielding hybrids and composites whose grains are dry, while the stalk and leaves may be still green.",
        "yie":"Yield:",
        "yie1":"armers using hybrid maize should not save their own seed for their next crop, as the advanced generation hybrid seeds are likely to yield reduction of 25-30 per cent. However, can save seed from composites and open pollinated varieties, when grown in isolation. At least seeds from 500 to 100 ears of the best yielding and normally spaced plants resistant to prevalent diseases and pests should be bulked",
        "sto":" Storage:",
        "sto1":"in peninsular India and at higher elevations, a mean yield of 5-7 tonnes per hectare has frequently been obtained. Under low fertility and rainfed conditions with poor yielding varieties, a grain yield of about on to two tonnes/ha is obtained."
        
    },
    
    {
        "name":"GROUNDNUT",
        "subname":"groundnut crop cultivationn",
        "cro":"Groundnut (Arachis hypogaea L.) is important oilseed crop and oil content of the seed varies from 44-50%, depending on the varieties and agronomic conditions. It is also used in soap making, and in manufacturing cosmetics and lubricants, olein, stearin and their salts. Kernels are also eaten raw, roasted or sweetened. They are rich in protein and vitamins A, B and members of the B2 group.",
        "climate":"The crop can be grown successfully in places receiving a minimum rainfall of 500mm and a maximum rainfall of 1,250mm. The rainfall should be distributed well during the flowering and pegging of the crop.The crop does best on sandy loam and loamy soils and in black soils with good drainage. Heavy and stiff clays are unsuitable for groundnut cultivation as the pod development is hampered in these soils.",
        "c1":"Germination",
        "r1":"21 to 28 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"25 to 35 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"22 to 30 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 25 0 C mean daily temperature.",
        "land":"The wheat crop requires a well-pulverized but compact seed bed for good and uniform germination. Three or four ploughings in the summer, repeated harrowing in the rainy season, followed by three or four cultivations and planking immediately before sowing produce a good, firm seed bed for the dry crop on alluvial soils. For the irrigated crop, the land is given a pre-sowing irrigation (palewa or raund) and the number of ploughings is reduced. Where white ants or other pests are a problem, Aldrin 5% or BHC 10% dust at the rate of 25 kg/ha should be applied to the soil after the last ploughing or before planking",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"'Junagadh-II', 'TMV-2', 'Pol-2', 'AK 12-24', 'Kopergaon-3', 'KG-61-240' (Jyothi)",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"'Punjab-I', 'GAUG-10','Kadiri-71.1', TMV-1', 'TMV-3', 'S-230', 'Karad4-11', 'TMV-6', 'TMV-8','Kopergaon-1', 'C-501'.",
        "plantdisease":"The disease occurs on all above ground parts of the plant, more severely on the leaves.The leaf symptoms produced by the two pathogens can be easily distinguished by appearance,spot colour and shapes. Both the fungi produce lesions also on petiole, stem and pegs. ",
        "pd":"Root rot",
        "pd2":"Reddish brown discolouration on the stem, spreading and the plant collapsing; tissues blackened and numerous tiny black scleriotia are formed.",
        "pd3":"Practise crop rotation, treat seed with Agrosan GN or Ceresan or Thiram @ 3gram per kg of seed,",
        "pd4":"2-2.5 g/kg of seed",
        "pd1":"Tikka disease or leaf spott",
        "pd12":"Dark spots surrounded by a bright-yellow ring on the leaves and sometimes on the petiole and the stem; premature leaf-shedding is characteristic",
        "pd13":"Zinc/Manganese",
        "pd14":"Spray with Brestan or with 4:4:50 Bordeaux mixture or with 0.2% Ziram or Zineb or Maneb",
        "pd02":"Groundnut aphid",
        "pd22":"Vector of a virus disease (rosette), dry and warm weather, favourable.",
        "pd23":"Spray 0.03% Dimethoate or Phosphamidon, Monocroptophos or Methyl-demeton",
        "pd24":"Dust 4% Carbaryl",
        "har":"Harvesting:",
        "har1":"groundnuts are ready for harvest between 85 and 130 days after sowing, depending on the variety. Pods can be harvested by hand or by mechanical means. Plants should be pulled from the ground and the pods removed. After harvest, pods are dried in the sun for 2–10 days until their moisture content is about 10%",
        "yie":"Yield:",
        "yie1":"TGroundnuts are cultivated in the tropical and subtropical regions of the world on sandy soils. Yields of groundnut vary from about 400 kg to several tonnes per hectare, depending on the production system, but on the average, the global yield is 2500–2700 kg per hectare.",
        "sto":" Storage:",
        "sto1":"The groundnut should be thoroughly dried before storage. The storage life of the grain is closely related to its moisture content. Grains with less than 10 percent moisture store well. The storage pits, bins or godowns should be moisture-proof and should be fumigated to keep down the stored – grain pests including rats. Zinc phosphide is very effective against rats."
        
    },
    {
        "name":"COTTON",
        "subname":"cotton crop cultivationn",
        "cro":"Cotton (Gossypium sp.) is one of the most important commercial crops playing a key role in economics. In India cotton is cultivated in 9 million hectares in varied agro-climatic conditions across nine major States. Cotton cultivation offers 200 mandays/ha of employment. It employs directly and indirectly more than 60 million persons in its production, processing and marketing. India has the largest area under cotton, but its production is just 15.8 million bales, much lower for the vast area.",
        "climate":"Cotton is a tropical and subtropical crop. For the successful germination of its seeds, a minimum temperature of 15o C is required. The optimum temperature range for vegetative growth is 21 o - 27 o C.",
        "c1":"Germination",
        "r1":"21 to 24 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"20 to 28 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"20 to 23 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"22 to 27 0 C mean daily temperature.",
        "land":"In cotton selection on of soil is very important. Cotton is grown on a variety of soils. Soil should be black medium to deep (90cm) having good drainage availability. Cotton does not tolerate water-logging condition. It is grown mainly as a dry crop in the black cotton and medium black soil. Irrigated cotton is taken in the alluvial soils.",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"D C H-32, J K H Y-1, H-4, H-6, Varlaxmi, Savita, Bikaneri Narma, R S T-9",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"R. A. J. H. H-16 (Maru Vikas), F-414, L.H.1556, Ganganagar agethi, H-777, R.S.875, TURAB, H.Y.10, L.R.A.-5166",
        "plantdisease":"Small, circular brown lesions on cotyledons and seedling leaves which expand and develop a concentric pattern; necrotic areas coalesce and often have a purple margin; centers of lesions may dry out and drop form the plant creating a shot-hole appearance on the leaves.",
        "pd":"Jassid and aphids",
        "pd2":"Nymphs and adults found on the underside of the leaves, sucking the sap; leaves turn yellow and start curling",
        "pd3":"Sow resistant varieties; spray the crop fortnightly with 0.02% Phosphamidon, Monocrotophos, Methyl demeton, Dichlorros or Dimethoate",
        "pd4":"2-2.5 g/kg of seed",
        "pd1":"American Bollworm",
        "pd12":"Destructive pest, caterpillar borer into square flowers and boll and feed within the boll",
        "pd13":"When infestation is seen spray following pyrethroids per hectare in 500 litres of water",
        "pd14":"Decamethrin 2.8%- 400ml or 20%- 250ml.",
        "pd02":"Molya",
        "pd22":" Deep summer ploughing",
        "pd23":"Nemagon DECP 60% EC dripping with first irrigation water",
        "pd24":"20 litres/ha 30 ml./ha",
        "har":"Harvesting:",
        "har1":"While harvesting is one of the final steps in the production of cotton crops, it is one of the most important. The crop must be harvested before weather can damage or completely ruin its quality and reduce yield",
        "yie":"Yield:",
        "yie1":"The national average yield of wheat grain is about 12 to 13.8 quintals per hectare.",
        "sto":" Storage:",
        "sto1":"Once harvested, seed cotton must be removed from the harvester and stored before it is delivered to the gin."
        
    },
    {
        "name":"RUPPER",
        "subname":"rupper crop cultivationn",
        "cro":"Malaysia, Indonesia, Thailand and Africa are the main rubber producing countries. Natural rubber for commercial production is available from Manihot glaziovii (cera rubber), Ficus elastica (India rubber), Castiolla elastica (Panama rubber), Parthenium argenatum (Guayul), Taraxacum koksaghyz and Hevea brasiliensis (Para rubber) and among them, Hevea brasiliensis is the most important commercial source of natural rubber. It is native of Brazil and was introduced in Asia in 1876. Rubber tree belongs to the natural order Euphorbiaceae. This tree is sturdy, tall and quick growing.",
        "climate":"Rubber exacts in its climatic requirements. The regions lying within 100 latitude on either side of the Equator is highly suitable for rubber cultivation. It requires a temperature ranging from 200 to 300C with a well distributed rainfall of 200-250cm over the year. It comes up in plains and also in slopes of mountainous regions ranging from 300-800m above sea level. This specific climate is available only in Kanyakumari district, Tamil Nadu and Kerala, which constitute the traditional area.",
        "c1":"Germination",
        "r1":"10 to 15 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"13 to 18 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"15 to 23 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"13 to 19 0 C mean daily temperature.",
        "land":" Rubber comes up in plains and also in slopes of mountainous regions ranging from 300-800m above sea level. This specific climate is available only in Kanyakumari district, Tamil Nadu and Kerala, which constitute the traditional area. It thrives well in deep well drained acidic soils of red lateritic loams or clayey loams with a pH varying from 4.5 to 6.0.",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"RMA IX, RMA-1, RMA-2, RMA-3",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":" RMA-4 and RMA-5, EPC super 1 X, EPC1X, EPC2X, and EPC3X.",
        "plantdisease":"Most of the major diseases of Hevea brasiliensis are of worldwide distribution (with the notable exception of South American leaf blight, against which strict quarantine regulations are enforced by rubber-growing countries outside the Americas to prevent the unauthorised import of Hevea) but their local severity and importance vary from one region to another.",
        "pd":"Abnormal leaf fall",
        "pd2":"Infected leaves fall in large numbers prematurely",
        "pd3":"pray Bordeaux mixture (1%) as prophylactic measure",
        "pd4":"Carbendazim 0.1% or Tridemorph 1.5% ",
        "pd1":"Powdery mildew",
        "pd12":"Ashy coating noticed on tender leaves",
        "pd13":"11-14 kg of 325 mesh fine sulphur dust per round per hectare.",
        "pd14":"1% Bordeaux mixture",
        "pd02":"Scale insects",
        "pd22":"Severly affected portion dry up and die",
        "pd23":"Spray malathion at 0.05% concentration",
        "pd24":"1%. Addition of ZnSo4 @ 0.2%",
        "har":"Harvesting:",
        "har1":"The rubber trees attain tappable stage in about seven years provided they possess the required girth of the trees. Seedling must attain a girth of 55cm at a height of 50cm from the ground. In the case of budded trees the girth should be 50 cm at a height of 125–150cm from the bud union. Tapping is the periodical removing of thin slices of bark to extract rubber latex.",
        "yie":"Yield:",
        "yie1":"In South India, the annual yield of rubber is about 375kg per hectare per annum from the seedlings, whereas budded plantations yield 900 to 1000kg of rubber/ha.",
        "sto":" Storage:",
        "sto1":"the rubber trees on tapping is channelled into a container, generally coconut shell cups, attached to them. Latex collected in coconut shell cups in transferred to clean buckets, two to three hours after tapping"
        
    },
    {
        "name":"CAHSEWNUT",
        "subname":"cashewnut crop cultivationn",
        "cro":"The Cashewnut (Anacardium occidentale L.) is one of the important nut trees grown in the tropical world. It is the native of Brazil. It is grown mostly on west coast area of Maharashtra, Goa, Karnataka, Kerala and Tamil Nadu.The dry nuts – kernels are of high nutritive value and also rich in protein, carbohydrates, minerals like calcium, phosphorus and iron.",
        "climate":"The Cashew requires a minimum rainfall of 60 cm per annum, but can stand extremes of rainfall from 20 cm to 400 cm. If there is sufficient water supply, it can withstand a long period of dry spell and low humidity.It is considered a crop of marginal land and is recommended for slopy and light soils.",
        "c1":"Germination",
        "r1":"20 to 30 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"22 to 29 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"25 to 33 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"21 to 27 0 C mean daily temperature.",
        "land":"The cashew is mostly grown as the rainfed crop and requires no irrigation in the high rainfall areas. However, if the rainfall is low, the cashew responses well to irrigation water at the time of fruit set upto full development stage of nuts",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"Vengurla 1, Vengurla 2, Vengurla 3, Vengurla 4",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"Vengurla 5, Vengurla 6, Kanaka, Dhana, VRI-1 (M 10/4)",
        "plantdisease":"Cashew, Anacardium occidentale, is an evergreen tree in the family Anacardiaceae grown for its edible fruits (nuts). The cashew tree has a branching main trunk and characteristic domed crown.For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"Angular leaf spot",
        "pd2":"Angular cream colored lesions with dark-brown margins on leaves of seedlings",
        "pd3":"Seed dressing with Vitavax/Benlate/G 696",
        "pd4":"Spray NSKE 5% ",
        "pd1":"Anthracnose ",
        "pd12":"Disease emergence favored by rainfall and high humidity",
        "pd13":"Drench the beds/bags with 0.1 % Agallol or 1 % Bordeaux mixture.",
        "pd14":"Spray 1 % Bordeaux mixture",
        "pd02":"Black mould",
        "pd22":" Damage most severe on dwarf cashew varieties",
        "pd23":"Nemagon DECP 60% EC dripping with first irrigation water",
        "pd24":"Blitox or Fytolan 0.25 %",
        "har":"Harvesting:",
        "har1":"The cashew is mostly grown as the rainfed crop and requires no irrigation in the high rainfall areas. However, if the rainfall is low, the cashew responses well to irrigation water at the time of fruit set upto full development stage of nuts. Irrigation should not be given before or at the time of flowering, as it is likely to promote vegetative growth.",
        "yie":"Yield:",
        "yie1":"The average yield per tree increases from about 2 kg at 3-5 years to 4 kg at 6-10 years and 5-10 kg when trees are 11-15 years of age. Thereafter, trees yield in excess of 10 kg as the trees get older.",
        "sto":" Storage:",
        "sto1":"The plant starts yielding 3rd year onwards. The peak picking months are March and May. Good nuts are grey green, smooth and well filled. After picking, the nuts are separated from the apple and dried in the sun for two to three days to bring down the moisture content to 10 to 12 %. Properly dried nuts are packed in alkathene bags. This will keep for 6 months."
        
    },
    {
        "name":"SUGARCANE",
        "subname":"sugarcane crop cultivationn",
        "cro":"sugarcane (Saccharum officinarum L.) is the main sources of sugar in India and holds a prominent position as a cash crop. India is the world’s largest consumer and the second largest producer of sugar, topped only by Brazil. Nearly 2.8 lakh farmers have been cultivating sugarcane in the vast area of 4.4 lakh acres and over 11 crore people are directly or indirectly dependent on the sugar industry in the country.",
        "climate":"Sugarcane is able to grow over a prolonged season. Under warm humid conditions, it can continue its growth, unless terminated by flowering. Temperatures above 50o C arrest its growth; those below 20 o C slow it down markedly and severe frost proves fatal. The crop does best in the tropical regions receiving a rainfall of 750-1200mm",
        "c1":"Germination",
        "r1":"27 to 41 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"26 to 45 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"15 to 37 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 25 0 C mean daily temperature.",
        "land":"Sugarcane grows best on medium heavy soils, but can also be raised on lighter soils and heavy clays, provided there is adequate irrigation available in the former type of soils and drainage is good in the latter type of soils",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"CO – 419, CO – 740, CO – 7219 (Sanjivini), CO.M – 7125, CO – 7527, CO.M – 88121(7714)",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"CO –8014 (Mahalaxmi), CO – 86032 (Nira), CO.C – 671, CO.C – 85061, CO - 8011, CO.M. – 7114, CO.S.I – 776",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"Smut",
        "pd2":"Roguing & burning of disease affected plants",
        "pd3":"Seed dressing with Vitavax/Benlate/G 696",
        "pd4":"KCI+Urea, 1% Hadron",
        "pd1":"Rust",
        "pd12":"Use of resistant varieties",
        "pd13":"Zinc/Manganese",
        "pd14":"0.05% Bavistin",
        "pd02":"Molya",
        "pd22":" Deep summer ploughing",
        "pd23":"Nemagon DECP 60% EC dripping with first irrigation water",
        "pd24":"2.5% Urea, 2.5% KCI",
        "har":"Harvesting:",
        "har1":"The sugar accumulated in the stem of sugarcane represents a balance between synthesis of sugar and its utilization. A well ripened harvested crop may lose its sugar within a few days after harvest, which tends to increase further due to high ambient temperature, pre-harvest burning, harvest and transportation injuries and microbial infestation.",
        "yie":"Yield:",
        "yie1":"Harvesting is done manually using various types of hand knives or hand axes. Harvesting requires skilled labourers as improper harvest of cane leads to loss of cane yield (thus sugar), poor juice quality and problems in milling due to extraneous matte",
        "sto":" Storage:",
        "sto1":"There is a real need to establish new criteria to measure deterioration in Louisiana harvested cane, in order to better predict: 1) the quality of the cane to be processed, and 2) the effect of harvest methods and storage conditions."
        
    },
    {
        "name":"JUTE",
        "subname":"jute crop cultivationn",
        "cro":"Jute (Corchorus capsularis L and C.olitorius L.) is one of the most important cash crops of eastern India. Exported as goods and as raw fibre. The crop is grown in West Bengal, Assam, Northern Bihar, south-eastern Orissa, Tripura and eastern Uttar Pradesh.The fibre is chiefly used for manufacturing hessian, sacking and carpet backing.",
        "climate":"Jute requires a warm and humid climate, with temperature fluctuation between 24o C and 37 o C, the optimum being around 34 o C. Constant rain or water logged conditions are harmful. In the seedling stage, water-logging is not tolerated. Alternate sunshine and rainy days are most conducive to growth.",
        "c1":"Germination",
        "r1":"23 to 32 0 C mean daily temperature",
        "c2":"Tillering",
        "r2":"24 to 37 0 C mean daily temperature",
        "c3":"Accelerated growth",
        "r3":"21 to 27 0 C mean daily temperature",
        "c4":"Proper grain filling",
        "r4":"23 to 30 0 C mean daily temperature.",
        "land":"Jute requires a warm and humid climate, with temperature fluctuation between 24o C and 37 o C, the optimum being around 34 o C. Constant rain or water logged conditions are harmful. In the seedling stage, water-logging is not tolerated. Alternate sunshine and rainy days are most conducive to growth.",
        "variety1":"Irrigated timely sown wheat varieties :",
        "varlist1":"JRC 321, JRC 212, JRC 7447, D 154, JRC 1108",
        "variety2":"Irrigated Late sown wheat varieties :",
        "varlist2":"JRO 632, JRO 878,JRO 7835,JRO 620, and C.G",
        "plantdisease":"For controlling diseases following chemicals are used. Preventive and control measures of the commonly occurring diseases in wheat",
        "pd":"Jute semilooper",
        "pd2":"The growth of the plants is checked, the late sown crop is more vulnerable; peak incidence occures in July to mid -August",
        "pd3":"Spray 0.05% Endosulfan or 0.1% Carbaryl",
        "pd4":"2-2.5 g/kg of seed",
        "pd1":"Jute stem weevil",
        "pd12":"Grubs attack nodal joints below the leaf base and the side of the leaf base",
        "pd13":"Remove and destroy stubble alternative host plants and infested plants",
        "pd14":"Dust 5-10%",
        "pd02":"False smut",
        "pd22":"Roguing & burning of disease affected plants",
        "pd23":"Seed dressing with Vitavax/Benlate/G 696",
        "pd24":"1-1.5 g/kg of seed",
        "har":"Harvesting:",
        "har1":"Jute may be harvested any time between 120 and 150 days. Early harvesting gives finer fibre of good quality. The compromise between quality and quantity is found in harvesting at the early pod stage or around 135 days of cropping. ",
        "yie":"Yield:",
        "yie1":"The average is 13 quintals per hectare. 27 quintals in the case of the capsularis varieties. the maximum potential being 40 quintals and 37 quintals respectively.",
        "sto":" Storage:",
        "sto1":"Harvesting is done by cutting the plants at or close to the ground level. In flooded land, plants are uprooted. The harvested plants are left in field for 2-3 days for the leaves to shed."
        
    }

]